MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS202/mcu.h
extern volatile ADCON4LBITS ADCON4Lbits __attribute__((__sfr__));

#define ADCON4H ADCON4H
extern volatile uint16_t ADCON4H __attribute__((__sfr__));
__extension__ typedef struct tagADCON4HBITS {
  union {
    struct {
      uint16_t C0CHS:2;
      uint16_t C1CHS:2;
    };
    struct {
      uint16_t C0CHS0:1;
      uint16_t C0CHS1:1;
      uint16_t C1CHS0:1;
      uint16_t C1CHS1:1;
    };
  };
} ADCON4HBITS;
extern volatile ADCON4HBITS ADCON4Hbits __attribute__((__sfr__));

#define ADMOD0L ADMOD0L
extern volatile uint16_t ADMOD0L __attribute__((__sfr__));
typedef struct tagADMOD0LBITS {
  uint16_t SIGN0:1;
  uint16_t DIFF0:1;
  uint16_t SIGN1:1;
  uint16_t DIFF1:1;
  uint16_t SIGN2:1;
  uint16_t :1;
  uint16_t SIGN3:1;
  uint16_t :1;
  uint16_t SIGN4:1;
  uint16_t :1;
  uint16_t SIGN5:1;
  uint16_t :1;
  uint16_t SIGN6:1;
  uint16_t :1;
  uint16_t SIGN7:1;
} ADMOD0LBITS;
extern volatile ADMOD0LBITS ADMOD0Lbits __attribute__((__sfr__));

#define ADMOD0H ADMOD0H
extern volatile uint16_t ADMOD0H __attribute__((__sfr__));
typedef struct tagADMOD0HBITS {
  uint16_t SIGN8:1;
  uint16_t :1;
  uint16_t SIGN9:1;
  uint16_t :1;
  uint16_t SIGN10:1;
  uint16_t :1;
  uint16_t SIGN11:1;
  uint16_t :1;
  uint16_t SIGN12:1;
  uint16_t :1;
  uint16_t SIGN13:1;
  uint16_t :1;
  uint16_t SIGN14:1;
} ADMOD0HBITS;
extern volatile ADMOD0HBITS ADMOD0Hbits __attribute__((__sfr__));

#define ADIEL ADIEL
extern volatile uint16_t ADIEL __attribute__((__sfr__));
typedef struct tagADIELBITS {
  uint16_t IE0:1;
  uint16_t IE1:1;
  uint16_t IE2:1;
  uint16_t IE3:1;
  uint16_t IE4:1;
  uint16_t IE5:1;
  uint16_t IE6:1;
  uint16_t IE7:1;
  uint16_t IE8:1;
  uint16_t IE9:1;
  uint16_t IE10:1;
  uint16_t IE11:1;
  uint16_t IE12:1;
  uint16_t IE13:1;
  uint16_t IE14:1;
} ADIELBITS;
extern volatile ADIELBITS ADIELbits __attribute__((__sfr__));

#define ADSTATL ADSTATL
extern volatile uint16_t ADSTATL __attribute__((__sfr__));
typedef struct tagADSTATLBITS {
  uint16_t AN0RDY:1;
  uint16_t AN1RDY:1;
  uint16_t AN2RDY:1;
  uint16_t AN3RDY:1;
  uint16_t AN4RDY:1;
  uint16_t AN5RDY:1;
  uint16_t AN6RDY:1;
  uint16_t AN7RDY:1;
  uint16_t AN8RDY:1;
  uint16_t AN9RDY:1;
  uint16_t AN10RDY:1;
  uint16_t AN11RDY:1;
  uint16_t AN12RDY:1;
  uint16_t AN13RDY:1;
  uint16_t AN14RDY:1;
} ADSTATLBITS;
extern volatile ADSTATLBITS ADSTATLbits __attribute__((__sfr__));

#define ADCMP0ENL ADCMP0ENL
extern volatile uint16_t ADCMP0ENL __attribute__((__sfr__));
typedef struct tagADCMP0ENLBITS {
  uint16_t CMPEN0:1;
  uint16_t CMPEN1:1;
  uint16_t CMPEN2:1;
  uint16_t CMPEN3:1;
  uint16_t CMPEN4:1;
  uint16_t CMPEN5:1;
  uint16_t CMPEN6:1;
  uint16_t CMPEN7:1;
  uint16_t CMPEN8:1;
  uint16_t CMPEN9:1;
  uint16_t CMPEN10:1;
  uint16_t CMPEN11:1;
  uint16_t CMPEN12:1;
  uint16_t CMPEN13:1;
  uint16_t CMPEN14:1;
} ADCMP0ENLBITS;
extern volatile ADCMP0ENLBITS ADCMP0ENLbits __attribute__((__sfr__));

#define ADCMP0LO ADCMP0LO
extern volatile uint16_t ADCMP0LO __attribute__((__sfr__));
#define ADCMP0HI ADCMP0HI
extern volatile uint16_t ADCMP0HI __attribute__((__sfr__));
#define ADCMP1ENL ADCMP1ENL
extern volatile uint16_t ADCMP1ENL __attribute__((__sfr__));
typedef struct tagADCMP1ENLBITS {
  uint16_t CMPEN0:1;
  uint16_t CMPEN1:1;
  uint16_t CMPEN2:1;
  uint16_t CMPEN3:1;
  uint16_t CMPEN4:1;
  uint16_t CMPEN5:1;
  uint16_t CMPEN6:1;
  uint16_t CMPEN7:1;
  uint16_t CMPEN8:1;
  uint16_t CMPEN9:1;
  uint16_t CMPEN10:1;
  uint16_t CMPEN11:1;
  uint16_t CMPEN12:1;
  uint16_t CMPEN13:1;
  uint16_t CMPEN14:1;
} ADCMP1ENLBITS;
extern volatile ADCMP1ENLBITS ADCMP1ENLbits __attribute__((__sfr__));

#define ADCMP1LO ADCMP1LO
extern volatile uint16_t ADCMP1LO __attribute__((__sfr__));
#define ADCMP1HI ADCMP1HI
extern volatile uint16_t ADCMP1HI __attribute__((__sfr__));
#define ADFL0DAT ADFL0DAT
extern volatile uint16_t ADFL0DAT __attribute__((__sfr__));
#define ADFL0CON ADFL0CON
extern volatile uint16_t ADFL0CON __attribute__((__sfr__));
__extension__ typedef struct tagADFL0CONBITS {
  union {
    struct {
      uint16_t FLCHSEL:5;
      uint16_t :3;
      uint16_t RDY:1;
      uint16_t IE:1;
      uint16_t OVRSAM:3;
      uint16_t MODE:2;
      uint16_t FLEN:1;
    };
    struct {
      uint16_t FLCHSEL0:1;
      uint16_t FLCHSEL1:1;
      uint16_t FLCHSEL2:1;
      uint16_t FLCHSEL3:1;
      uint16_t FLCHSEL4:1;
      uint16_t :5;
      uint16_t OVRSAM0:1;
      uint16_t OVRSAM1:1;
      uint16_t OVRSAM2:1;
    };
  };
} ADFL0CONBITS;
extern volatile ADFL0CONBITS ADFL0CONbits __attribute__((__sfr__));

#define ADTRIG0L ADTRIG0L
extern volatile uint16_t ADTRIG0L __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG0LBITS {
  union {
    struct {
      uint16_t TRGSRC0:5;
      uint16_t :3;
      uint16_t TRGSRC1:5;
    };
    struct {
      uint16_t TRIGSRC00:1;
      uint16_t TRIGSRC01:1;
      uint16_t TRIGSRC02:1;
      uint16_t TRIGSRC03:1;
      uint16_t TRIGSRC04:1;
      uint16_t :3;
      uint16_t TRGSRC10:1;
      uint16_t TRGSRC11:1;
      uint16_t TRGSRC12:1;
      uint16_t TRGSRC13:1;
      uint16_t TRGSRC14:1;
    };
    struct {
      uint16_t TRGSRC00:1;
      uint16_t TRGSRC01:1;
      uint16_t TRGSRC02:1;
      uint16_t TRGSRC03:1;
      uint16_t TRGSRC04:1;
    };
  };
} ADTRIG0LBITS;
extern volatile ADTRIG0LBITS ADTRIG0Lbits __attribute__((__sfr__));

#define ADTRIG0H ADTRIG0H
extern volatile uint16_t ADTRIG0H __attribute__((__sfr__));
__extension__ typedef struct tagADTRIG0HBITS {
  union {
    struct {
      uint16_t TRGSRC2:5;
      uint16_t :3;
      uint16_t TRGSRC3:5;
    };
    struct {
      uint16_t TRIGSRC20:1;
      uint16_t TRIGSRC21:1;
      uint16_t TRIGSRC22:1;
      uint16_t TRIGSRC23:1;
      uint16_t TRIGSRC24:1;
      uint16_t :3;
      uint16_t TRGSRC30:1;
      uint16_t TRGSRC31:1;
      uint16_t TRGSRC32:1;
      uint16_t TRGSRC33:1;
      uint16_t TRGSRC34:1;
    };
    struct {
      uint16_t TRGSRC20:1;
      uint16_t TRGSRC21:1;
      uint16_t TRGSRC22:1;
      uint16_t TRGSRC23:1;
      uint16_t TRGSRC24:1;
    };
  };
} ADTRIG0HBITS;
extern volatile ADTRIG0HBITS ADTRIG0Hbits __attribute__((__sfr__));

