MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS202/mcu.h
#define ADCORE1L ADCORE1L
extern volatile uint16_t ADCORE1L __attribute__((__sfr__));
__extension__ typedef struct tagADCORE1LBITS {
  union {
    struct {
      uint16_t SAMC:10;
    };
    struct {
      uint16_t SAMC0:1;
      uint16_t SAMC1:1;
      uint16_t SAMC2:1;
      uint16_t SAMC3:1;
      uint16_t SAMC4:1;
      uint16_t SAMC5:1;
      uint16_t SAMC6:1;
      uint16_t SAMC7:1;
      uint16_t SAMC8:1;
      uint16_t SAMC9:1;
    };
  };
} ADCORE1LBITS;
extern volatile ADCORE1LBITS ADCORE1Lbits __attribute__((__sfr__));

#define ADCORE1H ADCORE1H
extern volatile uint16_t ADCORE1H __attribute__((__sfr__));
__extension__ typedef struct tagADCORE1HBITS {
  union {
    struct {
      uint16_t ADCS:7;
      uint16_t :1;
      uint16_t RES:2;
      uint16_t EISEL:3;
    };
    struct {
      uint16_t ADCS0:1;
      uint16_t ADCS1:1;
      uint16_t ADCS2:1;
      uint16_t ADCS3:1;
      uint16_t ADCS4:1;
      uint16_t ADCS5:1;
      uint16_t ADCS6:1;
      uint16_t :1;
      uint16_t RES0:1;
      uint16_t RES1:1;
      uint16_t EISEL0:1;
      uint16_t EISEL1:1;
      uint16_t EISEL2:1;
    };
  };
} ADCORE1HBITS;
extern volatile ADCORE1HBITS ADCORE1Hbits __attribute__((__sfr__));

#define ADEIEL ADEIEL
extern volatile uint16_t ADEIEL __attribute__((__sfr__));
typedef struct tagADEIELBITS {
  uint16_t EIEN0:1;
  uint16_t EIEN1:1;
  uint16_t EIEN2:1;
  uint16_t EIEN3:1;
  uint16_t EIEN4:1;
  uint16_t EIEN5:1;
  uint16_t EIEN6:1;
  uint16_t EIEN7:1;
  uint16_t EIEN8:1;
  uint16_t EIEN9:1;
  uint16_t EIEN10:1;
  uint16_t EIEN11:1;
  uint16_t EIEN12:1;
  uint16_t EIEN13:1;
  uint16_t EIEN14:1;
} ADEIELBITS;
extern volatile ADEIELBITS ADEIELbits __attribute__((__sfr__));

#define ADEISTATL ADEISTATL
extern volatile uint16_t ADEISTATL __attribute__((__sfr__));
typedef struct tagADEISTATLBITS {
  uint16_t EISTAT0:1;
  uint16_t EISTAT1:1;
  uint16_t EISTAT2:1;
  uint16_t EISTAT3:1;
  uint16_t EISTAT4:1;
  uint16_t EISTAT5:1;
  uint16_t EISTAT6:1;
  uint16_t EISTAT7:1;
  uint16_t EISTAT8:1;
  uint16_t EISTAT9:1;
  uint16_t EISTAT10:1;
  uint16_t EISTAT11:1;
  uint16_t EISTAT12:1;
  uint16_t EISTAT13:1;
  uint16_t EISTAT14:1;
} ADEISTATLBITS;
extern volatile ADEISTATLBITS ADEISTATLbits __attribute__((__sfr__));

#define ADCON5L ADCON5L
extern volatile uint16_t ADCON5L __attribute__((__sfr__));
typedef struct tagADCON5LBITS {
  uint16_t C0PWR:1;
  uint16_t C1PWR:1;
  uint16_t C2PWR:1;
  uint16_t C3PWR:1;
  uint16_t C4PWR:1;
  uint16_t C5PWR:1;
  uint16_t C6PWR:1;
  uint16_t SHRPWR:1;
  uint16_t C0RDY:1;
  uint16_t C1RDY:1;
  uint16_t C2RDY:1;
  uint16_t C3RDY:1;
  uint16_t C4RDY:1;
  uint16_t C5RDY:1;
  uint16_t C6RDY:1;
  uint16_t SHRRDY:1;
} ADCON5LBITS;
extern volatile ADCON5LBITS ADCON5Lbits __attribute__((__sfr__));

#define ADCON5H ADCON5H
extern volatile uint16_t ADCON5H __attribute__((__sfr__));
__extension__ typedef struct tagADCON5HBITS {
  union {
    struct {
      uint16_t C0CIE:1;
      uint16_t C1CIE:1;
      uint16_t C2CIE:1;
      uint16_t C3CIE:1;
      uint16_t C4CIE:1;
      uint16_t C5CIE:1;
      uint16_t C6CIE:1;
      uint16_t SHRCIE:1;
      uint16_t WARMTIME:4;
    };
    struct {
      uint16_t C0C1E:1;
      uint16_t C1C1E:1;
      uint16_t C2C1E:1;
      uint16_t C3C1E:1;
      uint16_t C4C1E:1;
      uint16_t C5C1E:1;
      uint16_t C6C1E:1;
    };
  };
} ADCON5HBITS;
extern volatile ADCON5HBITS ADCON5Hbits __attribute__((__sfr__));

#define ADCAL0L ADCAL0L
extern volatile uint16_t ADCAL0L __attribute__((__sfr__));
typedef struct tagADCAL0LBITS {
  uint16_t CAL0RUN:1;
  uint16_t CAL0EN:1;
  uint16_t CAL0DIFF:1;
  uint16_t CAL0SKIP:1;
  uint16_t :3;
  uint16_t CAL0RDY:1;
  uint16_t CAL1RUN:1;
  uint16_t CAL1EN:1;
  uint16_t CAL1DIFF:1;
  uint16_t CAL1SKIP:1;
  uint16_t :3;
  uint16_t CAL1RDY:1;
} ADCAL0LBITS;
extern volatile ADCAL0LBITS ADCAL0Lbits __attribute__((__sfr__));

#define ADCAL1H ADCAL1H
extern volatile uint16_t ADCAL1H __attribute__((__sfr__));
typedef struct tagADCAL1HBITS {
  uint16_t :8;
  uint16_t CSHRRUN:1;
  uint16_t CSHREN:1;
  uint16_t CSHRDIFF:1;
  uint16_t CSHRSKIP:1;
  uint16_t :3;
  uint16_t CSHRRDY:1;
} ADCAL1HBITS;
extern volatile ADCAL1HBITS ADCAL1Hbits __attribute__((__sfr__));

#define ADCBUF0 ADCBUF0
extern volatile uint16_t ADCBUF0 __attribute__((__sfr__));
#define ADCBUF1 ADCBUF1
extern volatile uint16_t ADCBUF1 __attribute__((__sfr__));
#define ADCBUF2 ADCBUF2
extern volatile uint16_t ADCBUF2 __attribute__((__sfr__));
#define ADCBUF3 ADCBUF3
extern volatile uint16_t ADCBUF3 __attribute__((__sfr__));
#define ADCBUF4 ADCBUF4
extern volatile uint16_t ADCBUF4 __attribute__((__sfr__));
#define ADCBUF5 ADCBUF5
extern volatile uint16_t ADCBUF5 __attribute__((__sfr__));
#define ADCBUF6 ADCBUF6
extern volatile uint16_t ADCBUF6 __attribute__((__sfr__));
#define ADCBUF7 ADCBUF7
extern volatile uint16_t ADCBUF7 __attribute__((__sfr__));
#define ADCBUF8 ADCBUF8
extern volatile uint16_t ADCBUF8 __attribute__((__sfr__));
#define ADCBUF9 ADCBUF9
extern volatile uint16_t ADCBUF9 __attribute__((__sfr__));
#define ADCBUF10 ADCBUF10
extern volatile uint16_t ADCBUF10 __attribute__((__sfr__));
#define ADCBUF11 ADCBUF11
extern volatile uint16_t ADCBUF11 __attribute__((__sfr__));
#define ADCBUF12 ADCBUF12
extern volatile uint16_t ADCBUF12 __attribute__((__sfr__));
#define ADCBUF13 ADCBUF13
extern volatile uint16_t ADCBUF13 __attribute__((__sfr__));
#define ADCBUF14 ADCBUF14
extern volatile uint16_t ADCBUF14 __attribute__((__sfr__));
#define PGA1CON PGA1CON
extern volatile uint16_t PGA1CON __attribute__((__sfr__));
__extension__ typedef struct tagPGA1CONBITS {
  union {
    struct {
      uint16_t GAIN:3;
      uint16_t :5;
      uint16_t SELNI:3;
      uint16_t SELPI:3;
      uint16_t :1;
      uint16_t PGAEN:1;
    };
    struct {
      uint16_t GAIN0:1;
      uint16_t GAIN1:1;
      uint16_t GAIN2:1;
      uint16_t :5;
      uint16_t SELNI0:1;
      uint16_t SELNI1:1;
      uint16_t SELNI2:1;
      uint16_t SELPI0:1;
      uint16_t SELPI1:1;
      uint16_t SELPI2:1;
    };
  };
} PGA1CONBITS;
extern volatile PGA1CONBITS PGA1CONbits __attribute__((__sfr__));

#define PGA1CAL PGA1CAL
extern volatile uint16_t PGA1CAL __attribute__((__sfr__));
typedef struct tagPGA1CALBITS {
  uint16_t PGACAL:6;
} PGA1CALBITS;
extern volatile PGA1CALBITS PGA1CALbits __attribute__((__sfr__));

