MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS202/mcu.h
/* ADCMP0ENL */
/* Bitname _CMPEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN7 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN8 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN9 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN10 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN11 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN12 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN13 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN14 cannot be defined because it is used by more than one SFR */

/* ADCMP1ENL */
/* Bitname _CMPEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN1 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN2 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN3 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN4 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN5 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN6 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN7 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN8 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN9 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN10 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN11 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN12 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN13 cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN14 cannot be defined because it is used by more than one SFR */

/* ADFL0CON */
#define _FLCHSEL ADFL0CONbits.FLCHSEL
#define _RDY ADFL0CONbits.RDY
/* Bitname _IE cannot be defined because it is used by more than one SFR */
#define _OVRSAM ADFL0CONbits.OVRSAM
#define _MODE ADFL0CONbits.MODE
#define _FLEN ADFL0CONbits.FLEN
#define _FLCHSEL0 ADFL0CONbits.FLCHSEL0
#define _FLCHSEL1 ADFL0CONbits.FLCHSEL1
#define _FLCHSEL2 ADFL0CONbits.FLCHSEL2
#define _FLCHSEL3 ADFL0CONbits.FLCHSEL3
#define _FLCHSEL4 ADFL0CONbits.FLCHSEL4
#define _OVRSAM0 ADFL0CONbits.OVRSAM0
#define _OVRSAM1 ADFL0CONbits.OVRSAM1
#define _OVRSAM2 ADFL0CONbits.OVRSAM2

/* ADTRIG0L */
#define _TRGSRC0 ADTRIG0Lbits.TRGSRC0
#define _TRGSRC1 ADTRIG0Lbits.TRGSRC1
#define _TRIGSRC00 ADTRIG0Lbits.TRIGSRC00
#define _TRIGSRC01 ADTRIG0Lbits.TRIGSRC01
#define _TRIGSRC02 ADTRIG0Lbits.TRIGSRC02
#define _TRIGSRC03 ADTRIG0Lbits.TRIGSRC03
#define _TRIGSRC04 ADTRIG0Lbits.TRIGSRC04
/* Bitname _TRGSRC10 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC11 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC12 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC13 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC14 cannot be defined because it is used by more than one SFR */
#define _TRGSRC00 ADTRIG0Lbits.TRGSRC00
#define _TRGSRC01 ADTRIG0Lbits.TRGSRC01
#define _TRGSRC02 ADTRIG0Lbits.TRGSRC02
#define _TRGSRC03 ADTRIG0Lbits.TRGSRC03
#define _TRGSRC04 ADTRIG0Lbits.TRGSRC04

/* ADTRIG0H */
#define _TRGSRC2 ADTRIG0Hbits.TRGSRC2
#define _TRGSRC3 ADTRIG0Hbits.TRGSRC3
#define _TRIGSRC20 ADTRIG0Hbits.TRIGSRC20
#define _TRIGSRC21 ADTRIG0Hbits.TRIGSRC21
#define _TRIGSRC22 ADTRIG0Hbits.TRIGSRC22
#define _TRIGSRC23 ADTRIG0Hbits.TRIGSRC23
#define _TRIGSRC24 ADTRIG0Hbits.TRIGSRC24
#define _TRGSRC30 ADTRIG0Hbits.TRGSRC30
#define _TRGSRC31 ADTRIG0Hbits.TRGSRC31
#define _TRGSRC32 ADTRIG0Hbits.TRGSRC32
#define _TRGSRC33 ADTRIG0Hbits.TRGSRC33
#define _TRGSRC34 ADTRIG0Hbits.TRGSRC34
#define _TRGSRC20 ADTRIG0Hbits.TRGSRC20
#define _TRGSRC21 ADTRIG0Hbits.TRGSRC21
#define _TRGSRC22 ADTRIG0Hbits.TRGSRC22
#define _TRGSRC23 ADTRIG0Hbits.TRGSRC23
#define _TRGSRC24 ADTRIG0Hbits.TRGSRC24

/* ADTRIG1L */
#define _TRGSRC4 ADTRIG1Lbits.TRGSRC4
#define _TRGSRC5 ADTRIG1Lbits.TRGSRC5
#define _TRIGSRC40 ADTRIG1Lbits.TRIGSRC40
#define _TRIGSRC41 ADTRIG1Lbits.TRIGSRC41
#define _TRIGSRC42 ADTRIG1Lbits.TRIGSRC42
#define _TRIGSRC43 ADTRIG1Lbits.TRIGSRC43
#define _TRIGSRC44 ADTRIG1Lbits.TRIGSRC44
#define _TRGSRC50 ADTRIG1Lbits.TRGSRC50
#define _TRGSRC51 ADTRIG1Lbits.TRGSRC51
#define _TRGSRC52 ADTRIG1Lbits.TRGSRC52
#define _TRGSRC53 ADTRIG1Lbits.TRGSRC53
#define _TRGSRC54 ADTRIG1Lbits.TRGSRC54
#define _TRGSRC40 ADTRIG1Lbits.TRGSRC40
#define _TRGSRC41 ADTRIG1Lbits.TRGSRC41
#define _TRGSRC42 ADTRIG1Lbits.TRGSRC42
#define _TRGSRC43 ADTRIG1Lbits.TRGSRC43
#define _TRGSRC44 ADTRIG1Lbits.TRGSRC44

/* ADTRIG1H */
#define _TRGSRC6 ADTRIG1Hbits.TRGSRC6
#define _TRGSRC7 ADTRIG1Hbits.TRGSRC7
#define _TRIGSRC60 ADTRIG1Hbits.TRIGSRC60
#define _TRIGSRC61 ADTRIG1Hbits.TRIGSRC61
#define _TRIGSRC62 ADTRIG1Hbits.TRIGSRC62
#define _TRIGSRC63 ADTRIG1Hbits.TRIGSRC63
#define _TRIGSRC64 ADTRIG1Hbits.TRIGSRC64
#define _TRGSRC70 ADTRIG1Hbits.TRGSRC70
#define _TRGSRC71 ADTRIG1Hbits.TRGSRC71
#define _TRGSRC72 ADTRIG1Hbits.TRGSRC72
#define _TRGSRC73 ADTRIG1Hbits.TRGSRC73
#define _TRGSRC74 ADTRIG1Hbits.TRGSRC74
#define _TRGSRC60 ADTRIG1Hbits.TRGSRC60
#define _TRGSRC61 ADTRIG1Hbits.TRGSRC61
#define _TRGSRC62 ADTRIG1Hbits.TRGSRC62
#define _TRGSRC63 ADTRIG1Hbits.TRGSRC63
#define _TRGSRC64 ADTRIG1Hbits.TRGSRC64

/* ADTRIG2L */
#define _TRGSRC8 ADTRIG2Lbits.TRGSRC8
#define _TRGSRC9 ADTRIG2Lbits.TRGSRC9
#define _TRIGSRC80 ADTRIG2Lbits.TRIGSRC80
#define _TRIGSRC81 ADTRIG2Lbits.TRIGSRC81
#define _TRIGSRC82 ADTRIG2Lbits.TRIGSRC82
#define _TRIGSRC83 ADTRIG2Lbits.TRIGSRC83
#define _TRIGSRC84 ADTRIG2Lbits.TRIGSRC84
#define _TRGSRC90 ADTRIG2Lbits.TRGSRC90
#define _TRGSRC91 ADTRIG2Lbits.TRGSRC91
#define _TRGSRC92 ADTRIG2Lbits.TRGSRC92
#define _TRGSRC93 ADTRIG2Lbits.TRGSRC93
#define _TRGSRC94 ADTRIG2Lbits.TRGSRC94
#define _TRGSRC80 ADTRIG2Lbits.TRGSRC80
#define _TRGSRC81 ADTRIG2Lbits.TRGSRC81
#define _TRGSRC82 ADTRIG2Lbits.TRGSRC82
#define _TRGSRC83 ADTRIG2Lbits.TRGSRC83
#define _TRGSRC84 ADTRIG2Lbits.TRGSRC84

/* ADTRIG2H */
/* Bitname _TRGSRC10 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC11 cannot be defined because it is used by more than one SFR */
#define _TRIGSRC100 ADTRIG2Hbits.TRIGSRC100
#define _TRIGSRC101 ADTRIG2Hbits.TRIGSRC101
#define _TRIGSRC102 ADTRIG2Hbits.TRIGSRC102
#define _TRIGSRC103 ADTRIG2Hbits.TRIGSRC103
#define _TRIGSRC104 ADTRIG2Hbits.TRIGSRC104
#define _TRGSRC110 ADTRIG2Hbits.TRGSRC110
#define _TRGSRC111 ADTRIG2Hbits.TRGSRC111
#define _TRGSRC112 ADTRIG2Hbits.TRGSRC112
#define _TRGSRC113 ADTRIG2Hbits.TRGSRC113
#define _TRGSRC114 ADTRIG2Hbits.TRGSRC114
#define _TRGSRC100 ADTRIG2Hbits.TRGSRC100
#define _TRGSRC101 ADTRIG2Hbits.TRGSRC101
#define _TRGSRC102 ADTRIG2Hbits.TRGSRC102
#define _TRGSRC103 ADTRIG2Hbits.TRGSRC103
#define _TRGSRC104 ADTRIG2Hbits.TRGSRC104

/* ADTRIG3L */
/* Bitname _TRGSRC12 cannot be defined because it is used by more than one SFR */
/* Bitname _TRGSRC13 cannot be defined because it is used by more than one SFR */
#define _TRIGSRC120 ADTRIG3Lbits.TRIGSRC120
#define _TRIGSRC121 ADTRIG3Lbits.TRIGSRC121
#define _TRIGSRC122 ADTRIG3Lbits.TRIGSRC122
#define _TRIGSRC123 ADTRIG3Lbits.TRIGSRC123
#define _TRIGSRC124 ADTRIG3Lbits.TRIGSRC124
#define _TRGSRC130 ADTRIG3Lbits.TRGSRC130
#define _TRGSRC131 ADTRIG3Lbits.TRGSRC131
#define _TRGSRC132 ADTRIG3Lbits.TRGSRC132
#define _TRGSRC133 ADTRIG3Lbits.TRGSRC133
#define _TRGSRC134 ADTRIG3Lbits.TRGSRC134
#define _TRGSRC120 ADTRIG3Lbits.TRGSRC120
#define _TRGSRC121 ADTRIG3Lbits.TRGSRC121
#define _TRGSRC122 ADTRIG3Lbits.TRGSRC122
#define _TRGSRC123 ADTRIG3Lbits.TRGSRC123
#define _TRGSRC124 ADTRIG3Lbits.TRGSRC124

/* ADTRIG3H */
/* Bitname _TRGSRC14 cannot be defined because it is used by more than one SFR */
#define _TRIGSRC140 ADTRIG3Hbits.TRIGSRC140
#define _TRIGSRC141 ADTRIG3Hbits.TRIGSRC141
#define _TRIGSRC142 ADTRIG3Hbits.TRIGSRC142
#define _TRIGSRC143 ADTRIG3Hbits.TRIGSRC143
#define _TRIGSRC144 ADTRIG3Hbits.TRIGSRC144
#define _TRGSRC140 ADTRIG3Hbits.TRGSRC140
#define _TRGSRC141 ADTRIG3Hbits.TRGSRC141
#define _TRGSRC142 ADTRIG3Hbits.TRGSRC142
#define _TRGSRC143 ADTRIG3Hbits.TRGSRC143
#define _TRGSRC144 ADTRIG3Hbits.TRGSRC144

/* ADCMP0CON */
/* Bitname _LOLO cannot be defined because it is used by more than one SFR */
/* Bitname _LOHI cannot be defined because it is used by more than one SFR */
/* Bitname _HILO cannot be defined because it is used by more than one SFR */
/* Bitname _HIHI cannot be defined because it is used by more than one SFR */
/* Bitname _BTWN cannot be defined because it is used by more than one SFR */
/* Bitname _STAT cannot be defined because it is used by more than one SFR */
/* Bitname _IE cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL1 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL2 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL3 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL4 cannot be defined because it is used by more than one SFR */

/* ADCMP1CON */
/* Bitname _LOLO cannot be defined because it is used by more than one SFR */
/* Bitname _LOHI cannot be defined because it is used by more than one SFR */
/* Bitname _HILO cannot be defined because it is used by more than one SFR */
/* Bitname _HIHI cannot be defined because it is used by more than one SFR */
/* Bitname _BTWN cannot be defined because it is used by more than one SFR */
/* Bitname _STAT cannot be defined because it is used by more than one SFR */
/* Bitname _IE cannot be defined because it is used by more than one SFR */
/* Bitname _CMPEN cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL0 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL1 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL2 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL3 cannot be defined because it is used by more than one SFR */
/* Bitname _CHNL4 cannot be defined because it is used by more than one SFR */

/* ADLVLTRGL */
#define _LVLEN0 ADLVLTRGLbits.LVLEN0
#define _LVLEN1 ADLVLTRGLbits.LVLEN1
#define _LVLEN2 ADLVLTRGLbits.LVLEN2
#define _LVLEN3 ADLVLTRGLbits.LVLEN3
#define _LVLEN4 ADLVLTRGLbits.LVLEN4
#define _LVLEN5 ADLVLTRGLbits.LVLEN5
#define _LVLEN6 ADLVLTRGLbits.LVLEN6
#define _LVLEN7 ADLVLTRGLbits.LVLEN7
#define _LVLEN8 ADLVLTRGLbits.LVLEN8
#define _LVLEN9 ADLVLTRGLbits.LVLEN9
#define _LVLEN10 ADLVLTRGLbits.LVLEN10
#define _LVLEN11 ADLVLTRGLbits.LVLEN11
#define _LVLEN12 ADLVLTRGLbits.LVLEN12
#define _LVLEN13 ADLVLTRGLbits.LVLEN13
#define _LVLEN14 ADLVLTRGLbits.LVLEN14

/* ADCORE0L */
/* Bitname _SAMC cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC0 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC1 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC2 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC3 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC4 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC5 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC6 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC7 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC8 cannot be defined because it is used by more than one SFR */
/* Bitname _SAMC9 cannot be defined because it is used by more than one SFR */

